'''

벌집
시간 제한	메모리 제한	제출	정답	맞은 사람	정답 비율
2 초	128 MB	26221	12014	10403	46.432%
문제


위의 그림과 같이 육각형으로 이루어진 벌집이 있다. 그림에서 보는 바와 같이 중앙의 방 1부터 시작해서 이웃하는 방에 돌아가면서 1씩 증가하는 번호를 주소로 매길 수 있다. 숫자 N이 주어졌을 때, 벌집의 중앙 1에서 N번 방까지 최소 개수의 방을 지나서 갈 때 몇 개의 방을 지나가는지(시작과 끝을 포함하여)를 계산하는 프로그램을 작성하시오. 예를 들면, 13까지는 3개, 58까지는 5개를 지난다.

입력
첫째 줄에 N(1 ≤ N ≤ 1,000,000,000)이 주어진다.

출력
입력으로 주어진 방까지 최소 개수의 방을 지나서 갈 때 몇 개의 방을 지나는지 출력한다.

예제 입력 1
13
예제 출력 1
3

등차수열 점화식 : a(n) = k + (n-1)d
a(1) = k

이 수열의 일반항 a(n) = 1 + n*(n-1)*3

1 1+6 1+18 1+36 1+60
1 1+n*1*3 1+n*2*3 1+n*3*3 1+n*4*3 ...
1


6 12 18 24
'''

N = int(input())

def a(n): # 수열의 일반항
    return 1+n*(n-1)*3

x = 1 # 1부터 확인
while True:
    if N == 1:
        print(x)
        break
    if a(x)<N<=a(x+1):
        print(x+1)
        break
    x += 1

